trociny/devstat/devstat_netbsd.8
.\"
.\" Copyright (c) 2009 Mikolaj Golub
.\"	All rights reserved.
.\" 
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 
.\" THIS SOFTWARE IS PROVIDED BY AUTHOR AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL AUTHOR OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\" $Id$
.\"
.Dd July, 2009
.Dt devstat 8
.Os devstat
.Sh NAME
.Nm devstat
.Nd display device statistics.
.Sh SYNOPSIS
.Nm
[-M core] [-N system] [device]
.Sh DESCRIPTION
.Nm
utility displays device statistics provided by io_sysctl. 
Description of output fields can be found in
.Dq Pa sys/iostat.h .
.Sh OPTIONS
.Bl -tag -width flag
.It Fl N
Use specified executable image of the kernel.
.It Fl M
Extract statistics from specified core.
.Sh SEE ALSO
.Xr iostat 8 ,
.Xr vmstat 1 ,
.Xr systat 1 ,
.Sh AUTHOR
.An Mikolaj Golub
